package rspDungeon.character.player;

import rspDungeon.character.Character;

import java.util.Scanner;

public class Berserker extends Player {

    public Berserker(Scanner sc){
        super(sc);
        this.name = "Berserker";

        this.maxHP = 60;
        this.currentHP = 60;
        this.power = 15;
        this.resilience = 5;
        this.level = 1;
        this.currentMoney = 100;
        this.potionCount = 1;
    }

    @Override
    public void showImage(){
        System.out.println(
                "⢿⣟⡿⣿⣻⢿⡿⣿⢿⡿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢿⡿⣿⢿⡿⣿⢿⣿\n" +
                "⣾⣭⣟⡾⣽⢯⡿⣽⢯⣟⣷⡿⣾⣿⣽⣿⣿⣿⠛⡴⣽⣾⣿⣿⣿⣿⣿⣿⣯⣷⣿⣾⣟⣿⡽⣯⢿⣽⣻⣞\n" +
                "⡾⣵⢯⡿⣽⢯⡿⣽⣟⣯⣿⣿⣿⣿⣿⣿⣿⡏⢠⡙⣿⢿⣖⣻⣿⣿⣿⣿⣿⣿⣿⣷⣿⣯⣿⣟⡿⣞⣷⢯\n" +
                "⣽⢯⡿⣽⢯⣟⣿⣯⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏⠠⡘⣤⣾⢧⣾⣿⣿⣿⣿⣿⣿⣿⣿⣯⣿⣾⣟⣿⣻⣽⣟\n" +
                "⡽⣯⢿⣽⣻⢿⣾⢿⣷⣿⣿⣿⣿⣿⣿⣿⣿⠐⠠⢑⠢⣌⠻⡌⢿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣟⣯⣿⣯⣷⢿\n" +
                "⡽⣯⢿⣞⣿⣿⣻⣿⣿⣿⣿⣿⣿⣿⡿⠛⠃⠠⠁⠌⠒⡤⢳⡙⣣⡞⣶⢃⣿⣿⣿⣿⣿⣿⣿⣿⣯⣷⡿⣿\n" +
                "⣽⣻⣯⢿⣻⢞⣿⣿⣿⣿⣿⣿⣿⣿⠁⢀⡐⢠⠉⡄⢱⡘⢦⢃⡗⢺⣳⣿⣯⢿⣿⣿⣿⣿⣿⠻⢿⣽⣿⢿\n" +
                "⣳⣿⡽⢫⣅⠊⢿⣿⣿⣿⣿⣿⣿⡏⠀⠠⠐⠂⠜⡰⢃⡌⢳⢎⡼⠱⣘⠿⣙⢯⡹⢿⣿⡿⢡⣟⣦⢻⣿⣿\n" +
                "⣧⡉⣞⡵⣾⣧⠈⢿⣿⣿⣿⣿⣿⡧⠀⠀⠀⠈⡐⠐⢫⠐⢭⢊⠼⡁⠠⠘⣥⢻⠟⠳⣍⠳⣏⣾⣣⢛⣿⣽\n" +
                "⣽⣷⡈⢟⣿⣿⣇⢊⣿⣿⣿⣿⣿⠇⠀⠀⠀⠀⠈⠘⢄⠊⠄⠣⣀⠐⠠⢑⠠⠋⠌⠰⡨⣝⣯⢾⣽⢫⣿⣿\n" +
                "⣳⣿⣿⣶⣼⣿⣿⣆⠸⣿⣿⡿⠃⢀⠂⠀⠀⠀⠀⠄⠈⠐⡈⠐⠀⠀⠀⢾⣶⠀⠂⢁⠳⣜⣧⣿⣟⢯⣿⣿\n" +
                "⣟⣷⣿⢿⣿⡿⣿⣿⣆⠙⣿⠃⠀⠄⠀⣠⣶⠀⠀⠀⠀⡀⢀⠀⢄⠂⠄⢻⣿⣇⠀⢨⠘⣽⡾⣷⢯⣻⣿⣿\n" +
                "⣿⣻⣿⣿⡿⣿⣿⣿⣿⣆⠰⣆⠩⣀⣿⣿⠋⠀⠀⡐⠠⠠⣁⠊⠴⡈⠜⠠⢘⣿⡂⠄⣋⣶⠱⣾⣯⢷⣿⣿\n" +
                "⣿⢿⣿⣾⣿⣿⣿⣿⣿⢏⣠⡙⣳⣼⣿⡏⠀⢀⠂⠄⡁⠂⡵⠘⡴⣈⠒⠀⠉⢿⡅⡘⣴⢫⢹⣝⠊⣽⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⣄⡱⢹⣿⡟⠀⠠⠀⠄⠠⢐⠡⣞⠡⣓⢠⡀⡌⠤⠙⣇⠸⣴⡣⢄⢬⡘⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣾⣿⣿⠐⣠⢂⡐⢠⡘⢦⣱⡻⠴⢃⡙⠘⠣⣜⡇⠸⡴⣹⢞⡦⣹⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⠊⠀⠃⠝⠳⢉⠃⠁⢄⠢⡡⢌⡑⠢⣹⡇⡙⡶⡝⣮⢃⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠰⣀⠈⠐⠠⢈⡐⢨⡔⢧⡂⠌⠡⣸⡇⠐⣱⣛⠦⣹⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⡐⠤⡉⠆⣸⣿⡇⠒⣜⣣⢽⡠⠀⣽⣷⠀⢳⠛⡴⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠄⠠⠡⢄⠂⠽⣿⣇⠁⠌⢌⠷⡡⢹⣿⣿⡔⣀⢲⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡆⠀⠑⡈⢆⠈⣿⣿⠀⠲⠤⠚⢁⣾⣿⣿⣷⣾⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⠀⠈⡀⠀⢹⣿⡇⢀⢆⠣⢈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡐⢄⠣⢀⣿⡇⠌⢤⠃⢨⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠠⢍⠂⢿⣇⠘⣢⠉⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡧⠈⠆⢺⡷⠈⢆⢡⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⡁⠌⡘⣤⡗⢩⠘⣲⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣃⣄⡱⣠⣲⣝⣻⠄⢢⠱⣹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣆⡡⢃⡔⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣟⣻⣟⣟⣟⣿⣟⣻⣟⣿⣿⣻⣟⣿⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n");
    }

    //공격하기(이긴 경우)
    @Override
    public void attack(Character target) {
        target.currentHP -= power;
        if(target.currentHP < 0){
            target.currentHP = 0;
        }
        System.out.println("------------------------------------------------------------------------");
        System.out.println(target.name + "이(가) " + power + "만큼 데미지를 입습니다.");
        System.out.println(target.name + "의 현재 HP : " + target.currentHP);
        System.out.println("------------------------------------------------------------------------");
    }

    public void heal(){
        if((currentHP + resilience/2) < maxHP){
            currentHP += resilience/2;
        }else{
            currentHP = maxHP;
        }
        System.out.println("------------------------------------------------------------------------");
        System.out.println(name + "의 현재 HP : " + currentHP);
        System.out.println("------------------------------------------------------------------------");
    }

    public void levelUp(){
        maxHP += 10;
        if(currentHP + 10 < maxHP){
            currentHP += 10;
        }else{
            currentHP = maxHP;
        }
        power += 15;
        resilience += 5;
        level++;

        System.out.println("------------------------------------------------------------------------");
        System.out.println("LevelUp");
        System.out.println("HP가 10, 공격력이 15, 회복력이 5만큼 상승합니다.");
        System.out.println("현재 레벨: " + level);
        System.out.println("------------------------------------------------------------------------");
    }
}
