package rspDungeon.character.player;

import rspDungeon.character.Character;

import java.util.Scanner;

public class Tanker extends Player {
    public Tanker(Scanner sc) {
        super(sc);
        this.name = "Tanker";

        this.maxHP = 100;
        this.currentHP = 100;
        this.power = 5;
        this.resilience = 15;
        this.level = 1;
        this.currentMoney = 100;
        this.potionCount = 3;
    }

    @Override
    public void showImage(){
        System.out.println(
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⡟⠿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠓⠌⠐⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠱⢈⠐⠀⠀⠀⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠀⠈⢀⠀⠀⠀⠘⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠄⡋⠄⠀⠀⠀⢀⡘⠈⢉⡿⠋⠁⠀⠀⠈⠻⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⣱⡾⠷⠠⠄⠀⠀⠀⠀⠀⠀⡰⠃⠀⠀⡀⠁⠠⠁⡘⢿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠏⡐⣰⠉⠉⠀⠂⠀⠀⠀⠀⠀⡰⠃⠐⠀⠠⠐⠀⠄⠡⠀⠌⢻⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏⠐⠀⢘⠂⡄⠁⠀⠀⠀⠀⠀⡰⠍⠀⠀⣀⠂⠁⠠⠈⠄⡁⠐⡈⢿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⢌⠣⠐⠈⠠⠀⠁⠀⡰⠍⡀⠀⠀⠄⡀⠂⢀⠐⠀⠄⠡⠀⡸⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢈⠁⠀⣤⠃⡁⠂⠀⠀⠀⣰⠽⡐⠀⠀⠌⡀⠀⠀⠄⢂⠡⠈⠄⠰⣼⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⣸⣿⠀⠄⠀⠀⠀⠘⠠⢀⠀⠡⠌⡐⠀⠈⠄⠈⢰⠂⢁⠠⢸⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣟⠀⠁⢼⣿⡂⠀⠀⠀⠀⠀⠀⠈⠐⠀⠁⠈⢂⠀⠠⠀⠀⡂⠀⢠⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣂⠂⠹⡿⣁⠠⠀⠀⠀⠀⠀⠀⢠⠃⢀⠀⠀⠑⠀⠀⠀⠁⠠⣼⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣄⠸⠇⠐⢂⠀⠐⠀⠀⠀⠀⢠⠇⠰⠀⠌⡀⠀⠀⠀⠀⠰⣰⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⠀⠣⠄⡀⠀⠀⠀⠀⢠⠏⠀⡁⠄⠀⠐⡀⢀⠀⠀⢠⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡷⢀⠁⠀⠀⠀⠀⣠⡄⠘⠀⠀⠐⡈⠐⣠⠐⡀⠀⠂⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠂⠀⠀⢀⣿⡷⠀⠐⡈⠐⡀⠁⢦⡽⢀⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠀⠀⠀⠀⢀⣼⣿⣿⡄⠀⠐⠠⠠⢁⠀⠃⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⣿⣿⣿⣿⡇⠂⡀⠀⠀⠄⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⣿⣿⣿⣿⣿⡀⠀⠀⡀⠠⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⣼⣿⣿⣿⣿⣷⠀⠀⠀⡀⠸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⢰⣿⣿⣿⣿⣿⣿⡄⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠆⠀⠀⠀⢠⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡅⠀⠀⢠⣼⣿⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠁⠀⠀⢈⣿⣿⣿⣿⣿⣿⣿⣿⣦⡄⠀⠠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣯⡀⢀⣀⣴⣤⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⣤⣤⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n" +
                "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\n");
    }

    //공격하기(이긴 경우)
    @Override
    public void attack(Character target) {
        target.currentHP -= power;

        if(target.currentHP < 0){
            target.currentHP = 0;
        }
        System.out.println("------------------------------------------------------------------------");
        System.out.println(target.name + "이 " + power + "만큼 데미지를 입습니다.");
        System.out.println(target.name + "의 현재 HP : " + target.currentHP);
        System.out.println("------------------------------------------------------------------------");
    }

    //회복(비긴 경우)
    public void heal(){
        if((currentHP + resilience/2) < maxHP){
            currentHP += resilience/2;
        }else{
            currentHP = maxHP;
        }
        System.out.println("------------------------------------------------------------------------");
        System.out.println(name + "의 현재 HP : " + currentHP);
        System.out.println("------------------------------------------------------------------------");
    }

    public void levelUp(){
        level++;
        maxHP += 15;
        if(currentHP + 15 < maxHP){
            currentHP += 15;
        }else{
            currentHP = maxHP;
        }
        power += 5;
        resilience += 10;

        System.out.println("------------------------------------------------------------------------");
        System.out.println("LevelUp");
        System.out.println("HP가 15, 공격력이 5, 회복력이 10만큼 상승합니다.");
        System.out.println("현재 레벨: " + level);
        System.out.println("------------------------------------------------------------------------");
    }
}
